const String jlptN5 =
    "書,聞,話,語,読,間,電,時,来,校,高,何,先,前,南,国,学,後,東,毎,男,行,西,金,長,雨,食,万,三,上,下,中,二,五,人,今,休,八,六,円,出,北,十,千,午,半,友,右,名,四,土,外,大,天,女,子,小,川,左,年,日,月,木,本,母,気,水,火,父,生,白,百,見,車,一,七,九,入,山";

const String jlptN4 =
    "事,住,使,借,公,別,勉,動,医,味,品,員,問,堂,場,売,始,屋,帰,度,建,待,急,悪,意,持,料,新,旅,族,映,春,昼,曜,服,朝,業,楽,歌,注,洋,漢,物,特,界,病,発,真,着,研,秋,究,答,終,習,者,英,親,計,試,買,貸,質,起,転,送,運,道,重,野,銀,開,院,集,題,飯,飲,館,駅,験,家,教,紙,週,風,魚,鳥,黒,仕,以,去,夏,字,室,強,有,理,町,足,通,京,代,会,体,作,兄,同,図,地,多,夜,妹,姉,安,広,店,弟,思,明,歩,死,海,画,知,社,私,空,考,肉,自,色,茶,言,走,近,青,音,不,世,主,元,写,冬,切,力,古,台,夕,少,工,心,手,文,方,早,止,正,牛,犬,用,田,目,立,花,赤,口";

const String jlptN3 =
    "与,乗,予,争,互,件,任,伝,似,位,余,例,供,便,係,信,倒,候,値,偉,側,偶,備,働,優,共,具,冷,処,列,初,判,利,到,制,刻,割,加,助,努,労,務,勝,勤,単,危,原,参,反,収,受,合,君,否,吸,吹,告,呼,命,和,商,喜,因,困,園,在,報,増,変,夢,夫,好,妻,娘,婚,婦,存,宅,守,完,官,定,実,客,害,容,宿,寄,富,寒,寝,察,対,局,居,差,師,席,常,幸,幾,座,庭,式,役,彼,徒,得,御,忘,忙,念,怒,怖,性,恐,恥,息,悲,情,想,愛,感,慣,成,戦,戻,所,払,投,折,抜,抱,押,招,指,捕,掛,探,支,放,政,敗,散,数,断,易,昔,昨,晩,景,晴,暗,暮,更,最,望,期,束,杯,果,格,構,様,権,横,機,欲,歯,歳,残,段,殺,求,決,治,法,泳,洗,流,浮,消,深,済,渡,港,満,演,然,煙,熱,犯,状,猫,現,球,産,留,番,疑,疲,痛,登,皆,盗,相,眠,破,確,示,祖,神,福,程,種,積,突,窓,笑,等,箱,精,約,経,給,絵,絶,続,緒,罪,置,美,老,職,育,背,能,腹,舞,良,若,苦,落,葉,薬,術,表,要,規,覚,観,解,訪,許,認,誤,説,調,談,論,識,警,議,負,財,貧,責,費,資,賛,越,路,辞,込,迎,返,迷,追,退,逃,途,速,連,進,遅,遊,過,達,違,遠,適,選,部,都,配,酒,閉,関,降,限,除,険,陽,際,雑,難,静,非,面,靴,頂,頭,頼,顔,願,類,飛,馬,髪,鳴,失,民,組,船,記,亡,付,取,必,未,末,欠,由,礼,雪,両,全,化,号,向,回,声,平,当,形,曲,次,活,点,申,直,科,米,草,首,交,他,光,内,太,市,引,才,打,王,石,耳";

const String jlptN2 =
    "並,久,乱,乳,乾,介,仏,令,仲,伸,伺,低,依,個,倍,停,傾,像,億,兆,児,党,兵,冊,再,凍,刊,刷,券,刺,則,副,劇,効,勇,募,勢,包,匹,区,卒,協,占,印,卵,厚,双,叫,召,史,各,含,周,咲,喫,営,団,囲,固,圧,坂,均,型,埋,城,域,塔,塗,塩,境,奥,姓,委,季,孫,宇,寺,封,専,将,尊,導,届,層,岩,岸,島,巨,巻,布,希,帯,帽,幅,干,幼,庁,床,底,府,庫,延,律,復,快,恋,患,悩,憎,承,技,担,拝,拾,挟,捜,捨,掃,掘,採,接,換,損,改,敬,旧,昇,普,暴,曇,替,机,材,板,枚,枝,枯,柔,柱,査,栄,根,械,棒,森,植,極,橋,欧,武,歴,殿,毒,比,永,汗,汚,池,沈,河,沸,油,況,泉,泊,波,泥,浅,浴,涙,液,涼,混,清,減,温,測,湖,湯,湾,湿,準,溶,滴,漁,濃,濯,灯,灰,炭,焼,照,燃,燥,爆,片,版,珍,瓶,甘,畜,略,畳,療,省,県,短,砂,硬,磨,祈,祝,祭,禁,秒,移,税,章,童,競,符,筆,筒,算,管,築,簡,籍,粉,粒,紅,純,細,紹,絡,綿,総,緑,線,編,練,績,缶,署,群,翌,耕,肌,肩,肯,胃,胸,脂,脳,腕,腰,膚,臓,臣,舟,航,般,芸,荒,荷,菓,菜,著,蒸,蔵,薄,衣,袋,被,装,裏,補,複,触,訓,設,詞,詰,誌,課,諸,講,豊,象,貨,販,貯,貿,賞,賢,贈,超,跡,踊,軍,軒,軟,軽,輪,輸,辛,農,述,逆,造,郊,郵,量,針,鈍,鉄,鉱,銅,鋭,録,門,防,陸,隅,階,隻,雇,雲,零,震,革,順,預,領,額,香,駐,骨,鼻,齢,黄,弱,札,村,辺,州,星,林,皮,羽,血,角,谷,麦,丸,了,央,宝,戸,毛,氷,玉,皿,竹,糸,虫,貝";

const String jlptN1 =
    "且,丘,丹,乃,之,乏,乙,也,亀,井,亜,享,亭,亮,仁,仙,仮,仰,企,伊,伎,伏,伐,伯,伴,佐,佳,併,侍,価,侮,侵,促,俊,俗,保,修,俳,俵,俸,倉,倫,倹,偏,健,偵,偽,傍,傑,傘,催,債,傷,僕,僚,僧,儀,償,充,克,免,典,兼,冒,冗,冠,准,凌,凝,凡,凶,凸,凹,刃,刈,刑,削,剖,剛,剣,剤,剰,創,功,劣,励,劾,勘,勧,勲,匠,匿,升,卑,卓,博,即,却,卸,厄,厳,又,及,叔,叙,句,司,吉,后,吐,吟,呂,呈,呉,哀,哉,哲,唄,唆,唇,唯,唱,啓,善,喚,喝,喪,嘆,嘉,嘱,器,噴,囚,圏,坑,坪,垂,垣,執,培,基,堀,堅,堕,堤,堪,塀,塁,塊,塚,塾,墓,墜,墨,墳,壁,壇,壊,壌,士,壮,奇,奈,奉,奏,契,奔,奨,奪,奮,奴,如,妃,妄,妊,妙,妥,妨,姫,姻,姿,威,娠,娯,婆,婿,媒,媛,嫁,嫌,嬉,嬢,孔,孤,宗,宙,宜,宣,宮,宰,宴,寂,密,寛,寡,寧,審,寮,寸,射,尉,尋,尚,就,尺,尼,尽,尾,尿,屈,展,属,履,屯,岐,岬,岳,峠,峡,峰,崇,崎,崩,嵐,巡,巣,巧,己,帆,帝,帥,帳,幕,幣,幹,幻,幽,庄,序,庶,康,庸,廃,廉,廊,廷,弁,弊,弓,弔,弥,弦,弧,張,弾,彩,彫,彰,影,往,征,径,徐,従,循,微,徳,徴,徹,忌,忍,志,応,忠,怠,怪,恒,恨,恩,恭,恵,悔,悟,悠,悦,悼,惑,惜,惨,惰,愉,愚,慈,態,慎,慕,慢,慨,慮,慰,慶,憂,憤,憧,憩,憲,憶,憾,懇,懐,懲,懸,我,戒,戯,房,扇,扉,扱,扶,批,把,抑,抗,択,披,抵,抹,抽,拍,拐,拒,拓,拘,拙,拠,拡,括,拳,拷,挑,挙,振,挿,据,授,掌,排,控,推,措,掲,描,提,揚,握,揮,援,揺,搬,搭,携,搾,摂,摘,摩,撃,撤,撮,撲,擁,操,擦,擬,攻,故,敏,救,敢,整,敵,敷,斉,斎,斐,斗,斜,施,旋,旗,既,旦,旨,旬,昆,昌,昭,是,晶,智,暁,暇,暑,暖,暦,暫,曙,曹,朗,朱,朴,朽,杉,杏,条,松,析,枠,枢,架,柄,某,染,柳,栓,栞,株,核,栽,桃,案,桑,桜,桟,梅,梓,梨,棄,棋,棚,棟,椎,検,楓,概,槽,標,模,樹,欄,欺,款,歓,殉,殊,殖,殴,殻,汁,江,汰,汽,沖,沙,没,沢,沼,沿,泌,泡,泣,泰,洞,津,洪,派,浄,浜,浦,浪,浸,涯,淑,淡,添,渇,渉,渋,渓,渦,湧,源,溝,滅,滋,滑,滝,滞,漂,漆,漏,漠,漫,漬,漸,潔,潜,潟,潤,潮,澄,激,濁,瀬,災,炉,炊,炎,為,烈,焦,煩,煮,熊,熟,爽,牧,牲,犠,狂,狩,独,狭,猛,猟,献,猶,猿,獄,獣,獲,玄,率,珠,班,琴,瑛,瑞,瑠,璃,環,甚,甲,畔,異,疎,疫,疾,症,痢,痴,癒,癖,皇,盆,益,盛,盟,監,盤,盲,盾,眉,看,眺,眼,睡,督,睦,瞬,瞭,瞳,矛,矯,砕,砲,硫,碁,碑,磁,礁,礎,祉,祥,票,禅,禍,秀,秘,租,秩,称,稚,稲,稼,稿,穀,穂,穏,穫,穴,窃,窒,窮,竜,端,笛,第,筋,策,節,範,篤,簿,粋,粗,粘,粛,糖,糧,系,糾,紀,紋,納,級,紛,素,紡,索,紫,累,紳,紺,結,絞,統,絹,継,維,綱,網,綺,綾,緊,緋,締,緩,緯,縁,縄,縛,縦,縫,縮,繁,繊,織,繰,罰,罷,羅,義,翔,翻,翼,耐,聖,聡,聴,肖,肝,肢,肥,肪,肺,胆,胎,胞,胡,胴,脅,脈,脚,脱,腐,腸,膜,膨,臨,臭,至,致,興,舌,舎,舗,舶,艇,艦,芋,芝,芳,芽,苗,茂,茎,茜,荘,莉,菊,菌,華,萌,葬,葵,蒼,蓄,蓮,薦,藍,藤,藩,藻,虎,虐,虚,虜,虹,蚊,蛇,蛍,蛮,蝶,融,衆,街,衛,衝,衡,衰,裁,裂,裕,裸,製,褒,襟,襲,覆,覇,視,覧,訂,討,託,訟,訳,訴,診,証,詐,評,詠,詩,該,詳,誇,誉,誓,誕,誘,誠,請,諒,諭,諮,諾,謀,謙,謝,謡,謹,譜,譲,護,豆,豚,豪,貞,貢,貫,貴,賀,賃,賄,賊,賓,賠,購,赦,赴,趣,距,跳,践,踏,躍,軌,軸,較,載,輔,輝,輩,轄,辱,迅,迫,迭,透,逝,逮,逸,遂,遇,遍,遣,遥,遭,遮,遷,遺,遼,避,還,那,邦,邪,邸,郎,郡,郭,郷,酌,酔,酢,酪,酬,酵,酷,酸,醜,醸,釈,釣,鈴,鉛,鉢,銃,銘,銭,鋳,鋼,錠,錦,錬,錯,鍛,鎌,鎖,鎮,鏡,鐘,鑑,閑,閣,閥,閲,闘,阻,阿,陛,陣,陥,陪,陰,陳,陵,陶,隆,隊,随,隔,障,隠,隣,隷,隼,雄,雅,雌,離,雰,雷,需,霊,霜,霧,露,靖,響,項,須,頑,頻,顕,顧,颯,飢,飼,飽,飾,養,餓,駄,駆,駒,駿,騎,騒,騰,驚,髄,鬼,魂,魅,魔,鮮,鯉,鯨,鳩,鶏,鶴,鹿,麗,麻,黙,鼓,氏,斤,羊,丁,刀,矢,丑,丙,丞,亘,亥,亦,亨,伍,伶,伽,但,佑,侃,侑,侯,倖,倣,倭,偲,儒,允,冴,冶,凜,凪,凱,勁,勅,勺,匁,匡,卯,厘,叡,只,叶,吏,啄,喬,嗣,嚇,圭,塑,墾,壱,奎,嫡,孟,宏,宥,宵,寅,尭,峻,崚,嵩,嵯,嶺,巌,巳,巴,巽,弐,弘,彗,彦,彪,彬,怜,恕,悌,惇,惟,惣,愁,慧,抄,捷,捺,敦,斥,於,旭,旺,昂,昴,晃,晋,晏,晟,晨,暉,暢,朋,朔,朕,李,杜,柊,柚,柾,栗,桂,桐,梢,梧,棺,椋,椰,椿,楊,楠,楼,榛,槙,槻,樺,橘,檀,欣,欽,毅,毬,汐,洲,洵,洸,浩,淳,渚,渥,滉,漱,澪,濫,熙,燎,燦,燿,爵,爾,猪,玖,玲,琉,琢,琳,瑚,瑳,瑶,甫,畝,痘,皐,皓,眸,硝,碧,碩,磯,祐,禄,禎,秦,稀,稔,稜,穣,窯,竣,笙,笹,箇,紗,紘,紬,絃,絢,綜,綸,繕,繭,翁,翠,耀,耗,耶,肇,胤,脩,脹,舜,艶,芙,芹,苑,茄,茅,茉,莞,菖,菫,萩,蒔,蓉,蔦,蕉,蕗,薪,薫,蘭,虞,蚕,衷,衿,袈,裟,褐,詔,詢,誼,諄,謁,謄,賜,賦,赳,辰,迪,逐,逓,遵,邑,郁,酉,采,銑,錘,附,雛,霞,鞠,韻,頌,頒,馨,魁,鮎,鯛,鳳,鴻,鵬,鷹,麟,麿,黎,黛";

const String joyoG1 =
    "森,字,村,校,町,足,先,学,林,男,空,草,金,雨,青,音,三,上,下,中,二,五,人,休,八,六,円,出,力,十,千,右,名,四,土,夕,大,天,女,子,小,川,左,年,手,文,日,早,月,木,本,正,気,水,火,犬,玉,王,生,田,白,百,目,石,立,竹,糸,耳,花,虫,見,貝,赤,車,一,七,九,入,口,山";

const String joyoG2 =
    "公,原,合,園,場,売,寺,岩,帰,弓,数,新,春,昼,晴,曜,書,朝,楽,歌,池,汽,番,秋,答,算,細,絵,線,聞,親,計,話,語,読,買,道,遠,野,門,間,雲,電,頭,顔,馬,鳴,家,教,時,紙,組,船,記,週,風,魚,鳥,黄,黒,夏,室,弱,強,来,理,通,雪,高,京,会,体,何,作,兄,前,南,同,回,図,国,地,声,多,夜,妹,姉,広,店,弟,当,形,後,思,明,星,東,歩,毎,活,海,点,画,直,知,社,科,米,羽,考,肉,自,色,茶,行,西,角,言,谷,走,近,里,長,食,首,麦,万,丸,交,今,元,光,内,冬,刀,分,切,北,午,半,友,古,台,外,太,少,工,市,引,心,戸,才,方,止,母,毛,父,牛,用,矢";

const String joyoG3 =
    "乗,予,事,住,使,係,倍,具,列,助,勉,動,勝,区,医,反,受,君,味,命,和,品,員,商,問,坂,始,委,守,定,実,客,宮,宿,寒,対,局,屋,岸,島,帳,幸,度,庫,庭,式,役,待,急,息,悪,悲,想,意,感,所,投,拾,持,指,放,整,旅,族,昔,昭,暑,暗,服,期,板,柱,根,植,業,様,横,橋,歯,決,油,波,注,泳,洋,流,消,深,温,港,湖,湯,漢,炭,物,球,界,畑,病,発,登,相,県,真,着,短,研,神,祭,福,秒,究,章,童,笛,第,筆,等,箱,級,終,緑,練,美,習,者,育,苦,荷,落,葉,薬,表,詩,調,談,豆,負,起,路,身,転,軽,農,返,追,送,速,進,遊,運,部,都,配,酒,重,鉄,銀,開,院,陽,階,集,面,題,飲,館,駅,鼻,仕,去,取,有,由,礼,両,代,全,化,号,向,安,州,平,曲,次,死,申,皮,羊,血,丁,世,主,他,写,央,打,氷,皿";

const String joyoG4 =
    "争,令,仲,伝,位,低,例,便,信,倉,候,借,停,健,側,働,億,兆,児,共,兵,典,冷,初,別,利,刷,副,功,加,努,労,勇,包,卒,協,単,博,印,参,史,司,各,告,周,唱,喜,器,囲,固,型,堂,塩,士,変,夫,好,季,孫,完,官,害,察,巣,差,希,席,帯,底,府,康,建,径,徒,得,念,愛,成,戦,折,挙,改,救,敗,散,料,旗,昨,景,最,望,材,束,松,果,栄,案,梅,械,極,標,機,歴,残,殺,毒,求,治,法,泣,浅,浴,清,満,漁,灯,無,然,焼,照,熱,牧,特,産,的,省,祝,票,種,積,競,笑,管,節,粉,紀,約,結,給,続,置,老,胃,脈,腸,臣,航,良,芸,芽,英,菜,街,衣,要,覚,観,訓,試,説,課,議,象,貨,貯,費,賞,軍,輪,辞,連,達,選,郡,量,録,鏡,関,陸,隊,静,順,願,類,飛,飯,養,験,失,氏,民,付,以,必,未,末,札,欠,辺,不";

const String joyoG5 =
    "久,仏,仮,件,任,似,余,価,保,修,俵,個,備,像,再,刊,判,制,券,則,効,務,勢,厚,句,可,営,因,団,圧,在,均,基,報,境,墓,増,夢,妻,婦,容,寄,富,導,居,属,布,師,常,幹,序,弁,張,往,復,徳,志,応,快,性,恩,情,態,慣,承,技,招,授,採,接,提,損,支,政,故,敵,断,旧,易,暴,条,枝,査,格,桜,検,構,武,比,永,河,液,混,減,測,準,演,潔,災,燃,版,犯,状,独,率,現,留,略,益,眼,破,確,示,祖,禁,移,程,税,築,精,素,経,統,絶,綿,総,編,績,織,罪,群,義,耕,職,肥,能,興,舌,舎,術,衛,製,複,規,解,設,許,証,評,講,謝,識,護,豊,財,貧,責,貸,貿,賀,資,賛,質,輸,述,迷,退,逆,造,過,適,酸,鉱,銅,銭,防,限,険,際,雑,非,預,領,額,飼";

const String joyoG6 =
    "並,乱,乳,仁,供,俳,値,傷,優,党,冊,処,刻,割,創,劇,勤,危,卵,厳,収,后,否,吸,呼,善,困,垂,城,域,奏,奮,姿,存,孝,宅,宇,宗,宙,宣,密,寸,専,射,将,尊,就,尺,届,展,層,己,巻,幕,干,幼,庁,座,延,律,従,忘,忠,憲,我,批,担,拝,拡,捨,探,推,揮,操,敬,映,晩,暖,暮,朗,机,枚,染,株,棒,模,権,樹,欲,段,沿,泉,洗,派,済,源,潮,激,灰,熟,片,班,異,疑,痛,皇,盛,盟,看,砂,磁,秘,穀,穴,窓,筋,策,簡,糖,系,紅,納,純,絹,縦,縮,署,翌,聖,肺,背,胸,脳,腹,臓,臨,至,若,著,蒸,蔵,衆,裁,装,裏,補,視,覧,討,訪,訳,詞,誌,認,誕,誠,誤,論,諸,警,貴,賃,遺,郵,郷,針,鋼,閉,閣,降,陛,除,障,難,革,頂,骨,亡,私,宝,蚕";

const String joyoG9 =
    "丈,与,且,丘,串,丹,丼,乏,乙,乾,亀,互,井,亜,享,亭,介,仙,仰,企,伎,伏,伐,伯,伴,伸,伺,佐,佳,併,侍,依,侮,侵,促,俊,俗,俸,俺,倒,倫,倹,偉,偏,偵,偶,偽,傍,傑,傘,催,傲,債,傾,僕,僚,僧,儀,償,充,克,免,兼,冒,冗,冠,冥,凄,准,凍,凝,凡,凶,凸,凹,刃,刈,刑,到,刺,削,剖,剛,剣,剤,剰,劣,励,劾,勘,募,勧,勲,匂,匠,匹,匿,升,卑,卓,占,即,却,卸,厄,又,及,双,叔,叙,叫,召,叱,吉,吐,吟,含,吹,呂,呈,呉,呪,咲,哀,哲,哺,唄,唆,唇,唐,唯,啓,喉,喚,喝,喪,喫,嘆,嘱,噴,囚,圏,坊,坑,坪,垣,埋,執,培,埼,堀,堅,堕,堤,堪,塀,塁,塊,塔,塗,塚,塾,墜,墨,墳,壁,壇,壊,壌,壮,奇,奈,奉,契,奔,奥,奨,奪,奴,如,妃,妄,妊,妖,妙,妥,妨,姓,姫,姻,威,娘,娠,娯,婆,婚,婿,媒,媛,嫁,嫌,嬢,孔,孤,宛,宜,宰,宴,寂,寛,寝,寡,寧,審,寮,寿,封,尉,尋,尚,尻,尼,尽,尾,尿,屈,履,屯,岐,岡,岬,岳,峠,峡,峰,崇,崎,崖,崩,嵐,巡,巧,巨,巾,帆,帝,帥,帽,幅,幣,幻,幽,幾,床,庶,庸,廃,廉,廊,廷,弊,弔,弥,弦,弧,弾,彩,彫,彰,影,彼,征,徐,御,循,微,徴,徹,忌,忍,忙,怒,怖,怠,怪,恋,恐,恒,恥,恨,恭,恵,悔,悟,悠,患,悦,悩,悼,惑,惜,惨,惰,愉,愚,慈,慌,慎,慕,慢,慨,慮,慰,慶,憂,憎,憤,憧,憩,憶,憾,懇,懐,懲,懸,戒,戚,戯,戴,戻,房,扇,扉,払,扱,扶,把,抑,抗,抜,択,披,抱,抵,抹,押,抽,拉,拍,拐,拒,拓,拘,拙,拠,括,拳,拶,拷,挑,挟,挨,振,挿,捉,捕,捜,据,掃,掌,排,掘,掛,控,措,掲,描,揚,換,握,援,揺,搬,搭,携,搾,摂,摘,摩,撃,撤,撮,撲,擁,擦,擬,攻,敏,敢,敷,斉,斎,斗,斜,斬,施,旋,既,旦,旨,旬,昆,昇,是,普,晶,暁,暇,暦,暫,曇,更,曹,替,朱,朴,朽,杉,杯,析,枕,枠,枢,枯,架,柄,某,柔,柳,柵,栃,栓,核,栽,桃,桑,桟,梨,棄,棋,棚,棟,椅,椎,概,槽,欄,欧,欺,款,歓,歳,殉,殊,殖,殴,殻,殿,汁,汗,汚,江,汰,沈,沖,沙,没,沢,沸,沼,況,泊,泌,泡,泥,泰,洞,津,洪,浄,浜,浦,浪,浮,浸,涙,涯,涼,淑,淡,添,渇,渉,渋,渓,渡,渦,湧,湾,湿,溝,溶,滅,滋,滑,滝,滞,滴,漂,漆,漏,漠,漫,漬,漸,潜,潟,潤,澄,濁,濃,濯,瀬,炉,炊,炎,為,烈,焦,煎,煙,煩,煮,熊,燥,爆,爪,爽,牙,牲,犠,狂,狙,狩,狭,猛,猟,猫,献,猶,猿,獄,獣,獲,玄,珍,珠,琴,瑠,璃,璧,環,瓶,甘,甚,甲,畔,畜,畳,疎,疫,疲,疾,症,痢,痩,痴,療,癒,癖,皆,盆,盗,監,盤,盲,盾,眉,眠,眺,睡,督,睦,瞬,瞭,瞳,矛,矯,砕,砲,硫,硬,碁,碑,磨,礁,礎,祈,祉,祥,禅,禍,秀,租,秩,称,稚,稲,稼,稿,穂,穏,穫,突,窃,窒,窮,竜,端,符,筒,箸,範,篤,簿,籍,粋,粒,粗,粘,粛,粧,糧,糾,紋,紛,紡,索,紫,累,紳,紹,紺,絞,絡,継,維,綱,網,緊,緒,締,緩,緯,縁,縄,縛,縫,繁,繊,繰,缶,罰,罷,羅,羨,翻,翼,耐,聴,肌,肖,肝,股,肢,肩,肪,肯,胆,胎,胞,胴,脂,脅,脇,脊,脚,脱,腐,腕,腰,膚,膜,膝,膨,臭,致,舗,舞,舟,般,舶,艇,艦,芋,芝,芯,芳,苗,苛,茂,茎,茨,荒,荘,菊,菌,菓,華,葬,蓄,蔑,薄,薦,藍,藤,藩,藻,虎,虐,虚,虜,虹,蚊,蛇,蛍,蛮,蜂,蜜,融,衝,衡,衰,袋,袖,被,裂,裕,裸,褒,襟,襲,覆,覇,触,訂,託,訟,訴,診,詐,詠,詰,該,詳,誇,誉,誓,誘,誰,請,諦,諭,諮,諾,謀,謎,謙,謡,謹,譜,譲,豚,豪,貞,貢,販,貫,貼,賂,賄,賊,賓,賠,賢,賭,購,贈,赦,赴,超,越,趣,距,跡,跳,践,踊,踏,蹴,躍,軌,軒,軟,軸,較,載,輝,輩,轄,辛,辱,込,迅,迎,迫,迭,逃,透,途,逝,逮,逸,遂,遅,遇,遍,違,遜,遣,遭,遮,遷,避,還,那,邦,邪,邸,郊,郎,郭,酌,酎,酔,酢,酪,酬,酵,酷,醜,醸,釈,釣,鈍,鈴,鉛,鉢,銃,銘,鋭,鋳,錠,錦,錬,錯,鍋,鍛,鍵,鎌,鎖,鎮,鐘,鑑,閑,閥,閲,闇,闘,阜,阪,阻,陣,陥,陪,陰,陳,陵,陶,隅,隆,随,隔,隙,隠,隣,隷,隻,雄,雅,雇,雌,離,雰,零,雷,需,震,霊,霜,霧,露,靴,韓,響,頃,項,須,頑,頻,頼,顕,顧,飢,飽,飾,餅,餓,香,駄,駆,駐,駒,騎,騒,騰,驚,髄,髪,鬱,鬼,魂,魅,魔,鮮,鯨,鶏,鶴,鹿,麗,麺,麻,黙,鼓,齢,斤,了,丙,乞,但,侯,侶,倣,僅,儒,冶,刹,剥,勃,勅,勾,厘,吏,咽,唾,喩,嗅,嗣,嘲,嚇,堆,塑,塞,填,墾,壱,妬,嫉,嫡,宵,弄,弐,彙,怨,恣,惧,愁,慄,憬,抄,拭,挫,捗,捻,摯,斑,斥,旺,昧,曖,曽,朕,柿,桁,梗,棺,楷,楼,毀,氾,汎,沃,淫,溺,潰,濫,爵,玩,璽,瓦,畏,畝,畿,痕,痘,瘍,硝,稽,窟,窯,箇,箋,籠,綻,緻,繕,繭,罵,羞,翁,耗,肘,腎,腫,腺,膳,臆,臼,舷,艶,萎,葛,蓋,蔽,薪,薫,虞,衷,裾,褐,訃,詔,詣,詮,諧,謁,謄,貌,貪,賜,賦,踪,辣,逐,逓,遡,遵,醒,采,釜,錮,附,韻,頒,頓,頬,顎,餌,骸,麓";

const String mostCommon500 =
    "日,一,国,会,人,年,大,十,二,本,中,長,出,三,同,時,政,事,自,行,社,見,月,分,議,後,前,民,生,連,五,発,間,対,上,部,東,者,党,地,合,市,業,内,相,方,四,定,今,回,新,場,金,員,九,入,選,立,開,手,米,力,学,問,高,代,明,実,円,関,決,子,動,京,全,目,表,戦,経,通,外,最,言,氏,現,理,調,体,化,田,当,八,六,約,主,題,下,首,意,法,不,来,作,性,的,要,用,制,治,度,務,強,気,小,七,成,期,公,持,野,協,取,都,和,統,以,機,平,総,加,山,思,家,話,世,受,区,領,多,県,続,進,正,安,設,保,改,数,記,院,女,初,北,午,指,権,心,界,支,第,産,結,百,派,点,教,報,済,書,府,活,原,先,共,得,解,名,交,資,予,川,向,際,査,勝,面,委,告,軍,文,反,元,重,近,千,考,判,認,画,海,参,売,利,組,知,案,道,信,策,集,在,件,団,別,物,側,任,引,使,求,所,次,水,半,品,昨,論,計,死,官,増,係,感,特,情,投,示,変,打,男,基,私,各,始,島,直,両,朝,革,価,式,確,村,提,運,終,挙,果,西,勢,減,台,広,容,必,応,演,電,歳,住,争,談,能,無,再,位,置,企,真,流,格,有,疑,口,過,局,少,放,税,検,藤,町,常,校,料,沢,裁,状,工,建,語,球,営,空,職,証,土,与,急,止,送,援,供,可,役,構,木,割,聞,身,費,付,施,切,由,説,転,食,比,難,防,補,車,優,夫,研,収,断,井,何,南,石,足,違,消,境,神,番,規,術,護,展,態,導,鮮,備,宅,害,配,副,算,視,条,幹,独,警,宮,究,育,席,輸,訪,楽,起,万,着,乗,店,述,残,想,線,率,病,農,州,武,声,質,念,待,試,族,象,銀,域,助,労,例,衛,然,早,張,映,限,親,額,監,環,験,追,審,商,葉,義,伝,働,形,景,落,欧,担,好,退,準,賞,訴,辺,造,英,被,株,頭,技,低,毎,医,復,仕,去,姿,味,負,閣,韓,渡,失,移,差,衆,個,門,写,評,課,末,守,若,脳,極,種,美,岡,影,命,含,福,蔵,量,望,松,非,撃,佐,核,観,察,整,段,横,融,型,白,深,字,答,夜,製,票,況,音,申,様,財,港,識,注,呼,渉,達";

const String mostCommon500_1000 =
    "良,響,阪,帰,針,専,推,谷,古,候,史,天,階,程,満,敗,管,値,歌,買,突,兵,接,請,器,士,光,討,路,悪,科,攻,崎,督,授,催,細,効,図,週,積,丸,他,及,湾,録,処,省,旧,室,憲,太,橋,歩,離,岸,客,風,紙,激,否,周,師,摘,材,登,系,批,郎,母,易,健,黒,火,戸,速,存,花,春,飛,殺,央,券,赤,号,単,盟,座,青,破,編,捜,竹,除,完,降,超,責,並,療,従,右,修,捕,隊,危,採,織,森,競,拡,故,館,振,給,屋,介,読,弁,根,色,友,苦,就,迎,走,販,園,具,左,異,歴,辞,将,秋,因,献,厳,馬,愛,幅,休,維,富,浜,父,遺,彼,般,未,塁,貿,講,邦,舞,林,装,諸,夏,素,亡,劇,河,遣,航,抗,冷,模,雄,適,婦,鉄,寄,益,込,顔,緊,類,児,余,禁,印,逆,王,返,標,換,久,短,油,妻,暴,輪,占,宣,背,昭,廃,植,熱,宿,薬,伊,江,清,習,険,頼,僚,覚,吉,盛,船,倍,均,億,途,圧,芸,許,皇,臨,踏,駅,署,抜,壊,債,便,伸,留,罪,停,興,爆,陸,玉,源,儀,波,創,障,継,筋,狙,帯,延,羽,努,固,闘,精,則,葬,乱,避,普,散,司,康,測,豊,洋,静,善,逮,婚,厚,喜,齢,囲,卒,迫,略,承,浮,惑,崩,順,紀,聴,脱,旅,絶,級,幸,岩,練,押,軽,倒,了,庁,博,城,患,締,等,救,執,層,版,老,令,角,絡,損,房,募,曲,撤,裏,払,削,密,庭,徒,措,仏,績,築,貨,志,混,載,昇,池,陣,我,勤,為,血,遅,抑,幕,居,染,温,雑,招,奈,季,困,星,傷,永,択,秀,著,徴,誌,庫,弾,償,刊,像,功,拠,香,欠,更,秘,拒,刑,坂,刻,底,賛,塚,致,抱,繰,服,犯,尾,描,布,恐,寺,鈴,盤,息,宇,項,喪,伴,遠,養,懸,戻,街,巨,震,願,絵,希,越,契,掲,躍,棄,欲,痛,触,邸,依,籍,汚,縮,還,枚,属,笑,互,複,慮,郵,束,仲,栄,札,枠,似,夕,恵,板,列,露,沖,探,逃,借,緩,節,需,骨,射,傾,届,曜,遊,迷,夢,巻,購,揮,君,燃,充,雨,閉,緒,跡,包,駐,貢,鹿,弱,却,端,賃,折,紹,獲,郡,併,草,徹,飲,貴,埼,衝,焦,奪,雇,災,浦,暮,替,析,預,焼,簡,譲,称,肉,納,樹,挑,章,臓,律,誘,紛,貸,至,宗,促,慎,控";

const String mostCommon1000_1500 =
    "贈,智,握,照,宙,酒,俊,銭,薄,堂,渋,群,銃,悲,秒,操,携,奥,診,詰,託,晴,撮,誕,侵,括,掛,謝,双,孝,刺,到,駆,寝,透,津,壁,稲,仮,暗,裂,敏,鳥,純,是,飯,排,裕,堅,訳,盗,芝,綱,吸,典,賀,扱,顧,弘,看,訟,戒,祉,誉,歓,勉,奏,勧,騒,翌,陽,閥,甲,快,縄,片,郷,敬,揺,免,既,薦,隣,悩,華,泉,御,範,隠,冬,徳,皮,哲,漁,杉,里,釈,己,荒,貯,硬,妥,威,豪,熊,歯,滞,微,隆,埋,症,暫,忠,倉,昼,茶,彦,肝,柱,喚,沿,妙,唱,祭,袋,阿,索,誠,忘,襲,雪,筆,吹,訓,懇,浴,俳,童,宝,柄,驚,麻,封,胸,娘,砂,李,塩,浩,誤,剤,瀬,趣,陥,斎,貫,仙,慰,賢,序,弟,旬,腕,兼,聖,旨,即,洗,柳,舎,偽,較,覇,兆,床,畑,慣,詳,毛,緑,尊,抵,脅,祝,礼,窓,柔,茂,犠,旗,距,雅,飾,網,竜,詩,昔,繁,殿,濃,翼,牛,茨,潟,敵,魅,嫌,魚,斉,液,貧,敷,擁,衣,肩,圏,零,酸,兄,罰,怒,滅,泳,礎,腐,祖,幼,脚,菱,荷,潮,梅,泊,尽,杯,僕,桜,滑,孤,黄,煕,炎,賠,句,寿,鋼,頑,甘,臣,鎖,彩,摩,浅,励,掃,雲,掘,縦,輝,蓄,軸,巡,疲,稼,瞬,捨,皆,砲,軟,噴,沈,誇,祥,牲,秩,帝,宏,唆,鳴,阻,泰,賄,撲,凍,堀,腹,菊,絞,乳,煙,縁,唯,膨,矢,耐,恋,塾,漏,紅,慶,猛,芳,懲,郊,剣,腰,炭,踊,幌,彰,棋,丁,冊,恒,眠,揚,冒,之,勇,曽,械,倫,陳,憶,怖,犬,菜,耳,潜,珍,梨,仁,克,岳,概,拘,墓,黙,須,偏,雰,卵,遇,湖,諮,狭,喫,卓,干,頂,虫,刷,亀,糧,梶,湯,箱,簿,炉,牧,殊,殖,艦,溶,輩,穴,奇,慢,鶴,謀,暖,昌,拍,朗,丈,鉱,寛,覆,胞,泣,涙,隔,浄,匹,没,暇,肺,孫,貞,靖,鑑,飼,陰,銘,鋭,随,烈,尋,渕,稿,枝,丹,啓,也,丘,棟,壌,漫,玄,粘,悟,舗,妊,塗,熟,軒,旭,恩,毒,騰,往,豆,遂,晩,狂,叫,栃,岐,陛,緯,培,衰,艇,屈,径,淡,抽,披,廷,錦,准,暑,拝,磯,奨,妹,浸,剰,胆,氷,繊,駒,乾,虚,棒,寒,孜,霊,帳,悔,諭,祈,惨,虐,翻,墜,沼,据,肥,徐,糖,搭,姉,髪,忙,盾,脈,滝,拾,軌,俵,妨,盧,粉,擦,鯨,漢,糸,荘,諾,雷,漂,懐,勘,綿,栽,才,拐,笠,駄";

const String mostCommon1500_2000 =
    "添,汗,冠,斜,銅,鏡,聡,浪,亜,覧,詐,壇,勲,魔,酬,紫,湿,曙,紋,卸,奮,趙,欄,逸,涯,拓,眼,瓶,獄,筑,尚,阜,彫,咲,穏,顕,巧,矛,垣,召,欺,釣,缶,萩,粧,隻,葛,脂,粛,栗,愚,蒸,嘉,遭,架,篠,鬼,庶,肌,稚,靴,菅,滋,幻,煮,姫,誓,耕,把,践,呈,疎,仰,鈍,恥,剛,疾,征,砕,謡,嫁,謙,后,嘆,俣,菌,鎌,巣,泥,頻,琴,班,淵,棚,潔,酷,宰,廊,寂,辰,隅,偶,霞,伏,灯,柏,辛,磨,碁,俗,漠,邪,晶,辻,麦,墨,鎮,洞,履,劣,那,殴,娠,奉,憂,朴,亭,姓,淳,荻,筒,鼻,嶋,怪,粒,詞,鳩,柴,偉,酔,惜,穫,佳,潤,悼,乏,胃,該,赴,桑,桂,髄,虎,盆,晋,穂,壮,堤,飢,傍,疫,累,痴,搬,畳,晃,癒,桐,寸,郭,机,尿,凶,吐,宴,鷹,賓,虜,膚,陶,鐘,憾,畿,猪,紘,磁,弥,昆,粗,訂,芽,尻,庄,傘,敦,騎,寧,濯,循,忍,磐,猫,怠,如,寮,祐,鵬,塔,沸,鉛,珠,凝,苗,獣,哀,跳,灰,匠,菓,垂,蛇,澄,縫,僧,幾,眺,唐,亘,呉,凡,憩,鄭,芦,龍,媛,溝,恭,刈,睡,錯,伯,帽,笹,穀,柿,陵,霧,魂,枯,弊,釧,妃,舶,餓,腎,窮,掌,麗,綾,臭,釜,悦,刃,縛,暦,宜,盲,粋,辱,毅,轄,猿,弦,嶌,稔,窒,炊,洪,摂,飽,函,冗,涼,桃,狩,舟,貝,朱,渦,紳,枢,碑,鍛,刀,鼓,裸,鴨,符,猶,塊,旋,弓,幣,膜,扇,脇,腸,憎,槽,鍋,慈,皿,肯,樋,楊,伐,駿,漬,燥,糾,亮,墳,坪,畜,紺,慌,娯,吾,椿,舌,羅,坊,峡,俸,厘,峰,圭,醸,蓮,弔,乙,倶,汁,尼,遍,堺,衡,呆,薫,瓦,猟,羊,窪,款,閲,雀,偵,喝,敢,畠,胎,酵,憤,豚,遮,扉,硫,赦,挫,挟,窃,泡,瑞,又,慨,紡,恨,肪,扶,戯,伍,忌,濁,奔,斗,蘭,蒲,迅,肖,鉢,朽,殻,享,秦,茅,藩,沙,輔,曇,媒,鶏,禅,嘱,胴,粕,冨,迭,挿,湘,嵐,椎,灘,堰,獅,姜,絹,陪,剖,譜,郁,悠,淑,帆,暁,鷲,傑,楠,笛,芥,其,玲,奴,誰,錠,拳,翔,遷,拙,侍,尺,峠,篤,肇,渇,榎,俺,劉,幡,諏,叔,雌,亨,堪,叙,酢,吟,逓,痕,嶺,袖,甚,喬,崔,妖,琵,琶,聯,蘇,闇,崇,漆,岬,癖,愉,寅,捉,礁,乃,洲,屯,樽,樺,槙,薩,姻,巌,淀,麹,賭,擬,塀,唇,睦,閑,胡,幽,峻,曹,哨,詠";

const String mostCommon2000_2500 =
    "炒,屏,卑,侮,鋳,抹,尉,槻,隷,禍,蝶,酪,茎,汎,頃,帥,梁,逝,滴,汽,謎,琢,箕,匿,爪,芭,逗,苫,鍵,襟,蛍,楢,蕉,兜,寡,琉,痢,庸,朋,坑,姑,烏,藍,僑,賊,搾,奄,臼,畔,遼,唄,孔,橘,漱,呂,桧,拷,宋,嬢,苑,巽,杜,渓,翁,藝,廉,牙,謹,瞳,湧,欣,窯,褒,醜,魏,篇,升,此,峯,殉,煩,巴,禎,枕,劾,菩,堕,丼,租,檜,稜,牟,桟,榊,錫,荏,惧,倭,婿,慕,廟,銚,斐,罷,矯,某,囚,魁,薮,虹,鴻,泌,於,赳,漸,逢,凧,鵜,庵,膳,蚊,葵,厄,藻,萬,禄,孟,鴈,狼,嫡,呪,斬,尖,翫,嶽,尭,怨,卿,串,已,嚇,巳,凸,暢,腫,粟,燕,韻,綴,埴,霜,餅,魯,硝,牡,箸,勅,芹,杏,迦,棺,儒,鳳,馨,斑,蔭,焉,慧,祇,摯,愁,鷺,楼,彬,袴,匡,眉,苅,讃,尹,欽,薪,湛,堆,狐,褐,鴎,瀋,挺,賜,嵯,雁,佃,綜,繕,狛,壷,橿,栓,翠,鮎,芯,蜜,播,榛,凹,艶,帖,伺,桶,惣,股,匂,鞍,蔦,玩,萱,梯,雫,絆,錬,湊,蜂,隼,舵,渚,珂,煥,衷,逐,斥,稀,癌,峨,嘘,旛,篭,芙,詔,皐,雛,娼,篆,鮫,椅,惟,牌,宕,喧,佑,蒋,樟,耀,黛,叱,櫛,渥,挨,憧,濡,槍,宵,襄,妄,惇,蛋,脩,笘,宍,甫,酌,蚕,壕,嬉,囃,蒼,餌,簗,峙,粥,舘,銕,鄒,蜷,暉,捧,頒,只,肢,箏,檀,鵠,凱,彗,謄,諌,樫,噂,脊,牝,梓,洛,醍,砦,丑,笏,蕨,噺,抒,嗣,隈,叶,凄,汐,絢,叩,嫉,朔,蔡,膝,鍾,仇,伽,夷,恣,瞑,畝,抄,杭,寓,麺,戴,爽,裾,黎,惰,坐,鍼,蛮,塙,冴,旺,葦,礒,咸,萌,饗,歪,冥,偲,壱,瑠,韮,漕,杵,薔,膠,允,眞,蒙,蕃,呑,侯,碓,茗,麓,瀕,蒔,鯉,竪,弧,稽,瘤,澤,溥,遥,蹴,或,訃,矩,厦,冤,剥,舜,侠,贅,杖,蓋,畏,喉,汪,猷,瑛,搜,曼,附,彪,撚,噛,卯,桝,撫,喋,但,溢,闊,藏,浙,彭,淘,剃,揃,綺,徘,巷,竿,蟹,芋,袁,舩,拭,茜,凌,頬,厨,犀,簑,皓,甦,洸,毬,檄,姚,蛭,婆,叢,椙,轟,贋,洒,貰,儲,緋,貼,諜,鯛,蓼,甕,喘,怜,溜,邑,鉾,倣,碧,燈,諦,煎,瓜,緻,哺,槌,啄,穣,嗜,偕,罵,酉,蹄,頚,胚,牢,糞,悌,吊,楕,鮭,乞,倹,嗅,詫,鱒,蔑,轍,醤,惚,廣,藁,柚,舛,縞,謳,杞,鱗,繭,釘,弛,狸,壬,硯";

const Map<String, String> kanjiSet = {
  "JLPT N5": jlptN5,
  "JLPT N4": jlptN4,
  "JLPT N3": jlptN3,
  "JLPT N2": jlptN2,
  "JLPT N1": jlptN1,
  "Joyo Grade 1": joyoG1,
  "Joyo Grade 2": joyoG2,
  "Joyo Grade 3": joyoG3,
  "Joyo Grade 4": joyoG4,
  "Joyo Grade 5": joyoG5,
  "Joyo Grade 6": joyoG6,
  "Joyo Grade 9": joyoG9,
  "Most used 500": mostCommon500,
  "500 - 1000": mostCommon1000_1500,
  "1000 - 1500": mostCommon1500_2000,
  "1500 - 2000": mostCommon1500_2000,
};

int jlpt(String char) {
  if (jlptN5.contains(char)) {
    return 5;
  } else if (jlptN4.contains(char)) {
    return 4;
  } else if (jlptN3.contains(char)) {
    return 3;
  } else if (jlptN2.contains(char)) {
    return 2;
  } else if (jlptN1.contains(char)) {
    return 1;
  }

  return -1;
}


